package com.example.key.eiler_all;

/**
 * Created by Key on 10.03.2017.
 * Задача №6
 * Знайдіть різницю між сумою квадратів і квадратом суми перших ста натуральних чисел.
 */

public class Eiler_6 {
    public static void main(String[] args){
        int b=0; // змінна яка буде зберігати суму  натуральних чисел
        int c=0; // змінна яка зберігатиме суму квадратів натуральних чисел
        // цикл який буде переьирати натуральні числа від 1 до 100
        for(int i = 1; i < 101; i++){
            int k = i * i;// квадрат натурального числеа заданого циклом
            c=c+k;
            b=b+i;
        }

        int result = (b*b)-c;// різниця між квадратом суми і сумою квадратів
        System.out.println("result ="+result); // Відповідь 25164150
    }
}
