package com.example.key.eiler_all;

/**
 * Created by Key on 10.03.2017.
 * Задача №5
 * Яке найменше число ділиться без остачі на всі числа від 1 до 20?
 */

public class Eiler_5 {
    public static void main(String[] args){
        int a;
        //створюємо цикл який буде збільшувати значення циклу на одиницю
        for (a = 10000; a < 1000000000; a++) {
            //сортуємо ті значення які діляться на числа від 2 до 20
            if (a%2==0 && a%3==0 && a%4==0 && a%5==0 && a%6==0 && a%7==0 && a%8==0 &&
                    a%8==0 && a%9==0 && a%10==0 && a%11==0 && a%12==0 && a%13==0 && a%14==0 &&
                    a%15==0 && a%16==0 && a%17==0 && a%18==0 && a%19==0  &&  a%20==0) {
                System.out.println(a);// відповідь 232792560
                break;
            }
        }
    }
}
