package com.example.key.eiler_all;

/**
 * Created by Key on 10.03.2017.
 * Задача № 7
 * Яке число є 10001-им простим числом?
 */

public class Eiler_7 {
    public static void main(String[] args){
        // встановлюємо зміні величини
        int q = -1; // починаємо з -1 тому що починаючи цикл з нуля приведе до похибки починаєм з 1
        int n;
// цикл який буде перелічувати всі можливі цифри (натуральні і цілі)
        for (n = 1; n < 10000000; n++) {
            q=q+1;
// цикл буде перебирати дільники числа у верхньому циклі від 2 до n-1 щоб дізнатися чи число є простим чи ні
            for (int i = 2; i < n; i++) {
                if (n % i == 0) { //якщо хочаб одне число ділиться на n то це число не просте
                    q=q-1;
                    break;
                }
            }
            if (q==10001){
                System.out.println(q+"="+n); // Відповідь 104743
                break ;
            }
        }
    }
}
